load-test-scenario.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "워밍업"
    - duration: 120
      arrivalRate: 25
      name: "설날 예매 러시"
    - duration: 30
      arrivalRate: 10
      name: "안정화"
scenarios:
  - name: "KTX 예매 시도"
    weight: 100
    flow:
      - post:
          url: "/api/book-ktx"
          json:
            route: "서울 → 부산"
            date: "2025-02-09"
            passengers: 1
      - think: 2
      - get:
          url: "/api/queue-status"